Revit 2024 API
SpatialElementFromToCalculationPoints.IsAcceptableFromPosition Method
 Checks whether a given "from" position is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsAcceptableFromPosition(
	XYZ fromPosition
)
Visual Basic
Public Function IsAcceptableFromPosition ( _
	fromPosition As XYZ _
) As Boolean
Visual C++
public:
bool IsAcceptableFromPosition(
	XYZ^ fromPosition
)
Parameters
fromPosition
Type: Autodesk.Revit.DB.XYZ
Return Value
 True if the input is an acceptable "from" position and False otherwise.
Remarks
 The "from" position and the "to" position must be on opposite sides of the family's host. Flipping the calculation point will reverse the direction.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
SpatialElementFromToCalculationPoints Class
Autodesk.Revit.DB Namespace